using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Model_9H.Enums
{
    public enum CodeEnum
    {
        系统异常 = -1,
        成功 = 0,


        // 非数据库验证code
        OpenID不能为空 = 500001,
        OpenID格式错误 = 500002,
        商户订单号不能为空 = 500003,
        商户订单号格式错误 = 500004,
        订单金额不合法 = 500005,
        订单描述不能为空 = 500006,
        订单描述格式错误 = 500007,
        客户端IP不能为空 = 500008,
        客户端IP格式错误 = 500009,
        订单过期时间值不合法 = 500010,

        // 数据库操作code
        商户订单号已存在 = 550001,
        下单失败 = 550002,
        商户订单号不存在 = 550003,
        平台号不存在 = 550004,
        Sign验证失败 = 550005,
        通信异常 = 550006,
        查单失败 = 550007,
        微信服务器返回订单号不存在 = 550008,
        微信服务器返回订单未支付 = 550009,
        微信服务器返回订单转入退款 = 550010,
        公众平台统一下单OpenID不能为空 = 550011,
        公众平台统一下单OpenID格式错误 = 550012,

        //提现金额不合法 = 8600,
        //红包发放失败 = 8601,
        //商户名称格式错误 = 8602,
        //红包祝福语格式错误 = 8603,
        //活动名称格式错误 = 8604,
        //红包备注格式错误 = 8605,
        //OpenID不合法 = 8606,
        //红包订单号格式错误 = 8607,
        //红包查询失败 = 8608,
        //红包存单失败 = 8609,
        //红包单号已存在 = 8610,
        //红包单号不存在 = 8611,

        // 退款

        //退款金额不合法 = 8700,
        //退款失败 = 8701,
        //订单状态无法申请退款 = 8702,
        //退款单号不合法 = 8703,
        //退款单号已存在 = 8704,
        //退款查询失败 = 8800,
        //退款单号不存在 = 8801,
    }
}
