using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Model_9H.Enums
{
    public enum CodeEnum
    {
        成功 = 0,


        // 通用code
        服务器异常 = 8000,
        //商户订单号不能为空 = 8001,
        商户订单号格式错误 = 8002,
        订单总金额不合法 = 8003,
        //订单描述不能为空 = 8004,
        订单描述格式错误 = 8005,
        订单过期时间值不合法 = 8006,

        商户订单不存在 = 8007,
        商户订单信息与存单信息不符 = 8008,
        平台号不存在 = 8009,

        下单失败 = 8010,
        订单未支付 = 8011,
        //支付异常 = 8012,
        查单失败 = 8013,

        订单转入退款 = 8014,


        // 存单code
        UnionUserId格式错误 = 8200,
        商户订单号已存在 = 8201,
        存单失败 = 8202,

        // 支付宝code

        // 微信code
        Sign验证失败 = 8400,
        通信异常 = 8401,
        商户平台不存在此单号 = 8402,

        OpenId不能为空 = 8500,

        提现金额不合法 = 8600,
        红包发放失败 = 8601,
        商户名称格式错误 = 8602,
        红包祝福语格式错误 = 8603,
        活动名称格式错误 = 8604,
        红包备注格式错误 = 8605,
        OpenId不合法 = 8606,
        红包订单号格式错误 = 8607,
        红包查询失败 = 8608,
        红包存单失败 = 8609,
        红包单号已存在 = 8610,
        红包单号不存在 = 8611,

        // 退款

        退款金额不合法 = 8700,
        退款失败 = 8701,
        订单状态无法申请退款 = 8702,
        退款单号不合法 = 8703,
        退款单号已存在 = 8704,
        退款查询失败 = 8800,
        退款单号不存在 = 8801,
    }
}
